# Data Manipulation Studio

For this studio, we will revisit the data set from our last studio. If you recall, California farmers were looking for advice on growing pumpkins. We will use the same [pumpkins dataset](https://www.kaggle.com/usda/a-year-of-pumpkin-prices) as provided by the U.S. Department of Agriculture. You may have to clean data in the process of data manipulation, so feel free to pull up your notebook from the last class's studio.

We will now be focusing our attention on a different region in the United States, the Northeast. When you open up the `dataset` folder, you will have 13 CSVs, including the San Francisco and Los Angeles data from the last lesson. The 13 CSVs are each a different terminal market in the United States.

A **terminal market** is a central site, often in a metropolitan area, that serves as an assembly and trading place for commodities. Terminal markets for agricultural commodities are usually at or near major transportation hubs. [Definition Source](https://en.wikipedia.org/wiki/Terminal_market#:~:text=A%20terminal%20market%20is%20a,or%20near%20major%20transportation%20hubs)

## Getting Started

Import the CSVs for each of the following cities: Baltimore, Boston, New York, and Philadelphia. Set up a dataframe for each city.

In [1]:
# Import the necessary libraries and CSVs. Make some dataframes!
import pandas as pd
import numpy as np

baltimore = pd.read_csv('baltimore_9-24-2016_9-30-2017.csv')
boston = pd.read_csv('boston_9-24-2016_9-30-2017.csv')
new_york = pd.read_csv("new-york_9-24-2016_9-30-2017.csv")
philadelphia = pd.read_csv('philadelphia_9-24-2016_9-30-2017.csv')

## Clean Your Data

In the last lesson, we cleaned the data related to San Francisco. Pull up your notebook from the last lesson and use it as a reference to clean up these new dataframes.

**Recommended cleaning steps:**
1. Handle missing values in the `Type` column (fill with "Conventional" if needed)
2. Drop irrelevant columns such as `Grade` (only applies to canned pumpkins)
3. Drop columns with high percentages of missing data that aren't needed for analysis
4. Check for and address any other data quality issues you notice

In [2]:
# Clean your data here!
baltimore["Type"] = baltimore["Type"].fillna("Conventional")
boston["Type"] = boston["Type"].fillna("Conventional")
new_york["Type"] = new_york["Type"].fillna("Conventional")
philadelphia["Type"] = philadelphia["Type"].fillna("Conventional")

In [3]:
baltimore = baltimore.drop(["Grade"], axis=1) 
boston = boston.drop(["Grade"], axis=1) 
new_york = new_york.drop(["Grade"], axis=1) 
philadelphia = philadelphia.drop(['Grade'], axis = 1)

In [4]:
print(baltimore.isnull().sum())

Commodity Name       0
City Name            0
Type                 0
Package              0
Variety              2
Sub Variety        128
Date                 0
Low Price            0
High Price           0
Mostly Low           0
Mostly High          0
Origin               5
Origin District    153
Item Size           25
Color              122
Environment        153
Unit of Sale       129
Quality            153
Condition          153
Appearance         153
Storage            153
Crop               153
Repack               0
Trans Mode         153
dtype: int64

In [5]:
baltimore = baltimore.drop(['Sub Variety', 'Origin District', 'Color', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis = 1)

In [6]:
boston = boston.drop(['Color','Sub Variety', 'Origin District', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis=1)

In [7]:
new_york = new_york.drop(['Color','Sub Variety', 'Origin District', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis=1)

In [8]:
philadelphia = philadelphia.drop(['Color','Sub Variety', 'Origin District', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis=1)

In [9]:
boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 352 entries, 0 to 351
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  352 non-null    object
 1   City Name       352 non-null    object
 2   Type            352 non-null    object
 3   Package         352 non-null    object
 4   Variety         352 non-null    object
 5   Date            352 non-null    object
 6   Low Price       352 non-null    int64
 7   High Price      352 non-null    int64
 8   Mostly Low      352 non-null    int64
 9   Mostly High     352 non-null    int64
 10  Origin          352 non-null    object
 11  Item Size       348 non-null    object
 12  Unit of Sale    46 non-null     object
 13  Repack          352 non-null    object
dtypes: int64(4), object(10)
memory usage: 38.6+ KB

In [10]:
baltimore.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  153 non-null    object
 1   City Name       153 non-null    object
 2   Type            153 non-null    object
 3   Package         153 non-null    object
 4   Variety         151 non-null    object
 5   Date            153 non-null    object
 6   Low Price       153 non-null    int64
 7   High Price      153 non-null    float64
 8   Mostly Low      153 non-null    int64
 9   Mostly High     153 non-null    float64
 10  Origin          148 non-null    object
 11  Item Size       128 non-null    object
 12  Unit of Sale    24 non-null     object
 13  Repack          153 non-null    object
dtypes: float64(2), int64(2), object(10)
memory usage: 16.9+ KB

In [11]:
baltimore[['High Price', 'Mostly High']] = baltimore[['High Price', 'Mostly High']].astype(int)

In [12]:
baltimore.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  153 non-null    object
 1   City Name       153 non-null    object
 2   Type            153 non-null    object
 3   Package         153 non-null    object
 4   Variety         151 non-null    object
 5   Date            153 non-null    object
 6   Low Price       153 non-null    int64
 7   High Price      153 non-null    int64
 8   Mostly Low      153 non-null    int64
 9   Mostly High     153 non-null    int64
 10  Origin          148 non-null    object
 11  Item Size       128 non-null    object
 12  Unit of Sale    24 non-null     object
 13  Repack          153 non-null    object
dtypes: int64(4), object(10)
memory usage: 16.9+ KB

In [13]:
new_york.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  112 non-null    object
 1   City Name       112 non-null    object
 2   Type            112 non-null    object
 3   Package         112 non-null    object
 4   Variety         112 non-null    object
 5   Date            112 non-null    object
 6   Low Price       112 non-null    int64
 7   High Price      112 non-null    int64
 8   Mostly Low      112 non-null    int64
 9   Mostly High     112 non-null    int64
 10  Origin          112 non-null    object
 11  Item Size       104 non-null    object
 12  Unit of Sale    25 non-null     object
 13  Repack          112 non-null    object
dtypes: int64(4), object(10)
memory usage: 12.4+ KB

In [14]:
philadelphia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  57 non-null     object
 1   City Name       57 non-null     object
 2   Type            57 non-null     object
 3   Package         57 non-null     object
 4   Variety         57 non-null     object
 5   Date            57 non-null     object
 6   Low Price       57 non-null     int64
 7   High Price      57 non-null     int64
 8   Mostly Low      57 non-null     int64
 9   Mostly High     57 non-null     int64
 10  Origin          57 non-null     object
 11  Item Size       45 non-null     object
 12  Unit of Sale    11 non-null     object
 13  Repack          57 non-null     object
dtypes: int64(4), object(10)
memory usage: 6.4+ KB

## Combine Your Data

Now that you have four clean sets of data, combine all four into one dataframe that represents the entire Northeast region.

In [15]:
# Combine the four dataframes into one!
northeast_region = baltimore.merge(boston, how='outer').merge(new_york, how='outer').merge(philadelphia, how='outer')

## Answer Some Questions

Use `groupby()` and `agg()` to answer the following two questions:

1. What is the mean low and high prices for each type of **unit of sale** in the Northeast region?
2. For the Northeast region, what is the total count of transactions (rows) for each pumpkin variety that came into terminal markets for the year?

In [16]:
# Put your code here to find the mean low and high prices in the Northeast region for each type of unit of sale.
northeast_region.groupby('Unit of Sale').agg(
    high_price_avg = ('High Price', 'mean'),
    low_price_avg = ("Low Price", 'mean')
)

              high_price_avg  low_price_avg
Unit of Sale
EACH               59.166667      47.916667
PER BIN           206.619718     185.845070
SHELLACKED         17.545455      16.000000

In [17]:
# Put your code here to find the total count of transactions for each variety in the Northeast region.
northeast_region.groupby('Variety').agg(
    total_count = ('Commodity Name', 'count')
)

                          total_count
Variety
BIG MACK TYPE                      55
BLUE TYPE                           7
CINDERELLA                         39
FAIRYTALE                          37
HOWDEN TYPE                       224
HOWDEN WHITE TYPE                   2
KNUCKLE HEAD                        9
MINIATURE                          97
MIXED HEIRLOOM VARIETIES            4
PIE TYPE                          198

## Bonus Mission

Try answering the same questions for a different region! Choose either:
- **Midwest**: Chicago, Detroit, and St. Louis
- **Southeast**: Atlanta, Columbia, and Miami

Load, clean, and combine the data for your chosen region, then calculate:
1. The mean low and high prices for each type of unit of sale
2. The total count of transactions for each pumpkin variety

In [18]:
# Try the bonus mission if you have time!

chicago = pd.read_csv("chicago_9-24-2016_9-30-2017.csv")
detroit = pd.read_csv("detroit_9-24-2016_9-30-2017.csv")
st_louis = pd.read_csv("st-louis_9-24-2016_9-30-2017.csv")

In [22]:
chicago.isnull().sum()

Commodity Name       0
City Name            0
Type               239
Package              0
Variety              0
Sub Variety        198
Grade              248
Date                 0
Low Price            0
High Price           0
Mostly Low           0
Mostly High          0
Origin               0
Origin District    239
Item Size            0
Color              206
Environment        248
Unit of Sale       248
Quality            248
Condition          248
Appearance         248
Storage            248
Crop               248
Repack               0
Trans Mode         248
dtype: int64

In [23]:
chicago["Type"] = chicago["Type"].fillna("Conventional")

In [24]:
chicago = chicago.drop(['Grade','Sub Variety', 'Origin District', 'Color', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis = 1)

In [25]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  248 non-null    object
 1   City Name       248 non-null    object
 2   Type            248 non-null    object
 3   Package         248 non-null    object
 4   Variety         248 non-null    object
 5   Date            248 non-null    object
 6   Low Price       248 non-null    float64
 7   High Price      248 non-null    float64
 8   Mostly Low      248 non-null    float64
 9   Mostly High     248 non-null    float64
 10  Origin          248 non-null    object
 11  Item Size       248 non-null    object
 12  Unit of Sale    0 non-null      float64
 13  Repack          248 non-null    object
dtypes: float64(5), object(9)
memory usage: 27.3+ KB

In [26]:
chicago[['Low Price','High Price', 'Mostly Low', 'Mostly High']] = chicago[['Low Price','High Price', 'Mostly Low', 'Mostly High']].astype(int)

In [27]:
detroit["Type"] = detroit["Type"].fillna("Conventional")

In [28]:
detroit = detroit.drop(['Grade','Sub Variety', 'Origin District', 'Color', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis = 1)

In [29]:
detroit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Commodity Name  44 non-null     object
 1   City Name       44 non-null     object
 2   Type            44 non-null     object
 3   Package         44 non-null     object
 4   Variety         44 non-null     object
 5   Date            44 non-null     object
 6   Low Price       44 non-null     int64
 7   High Price      44 non-null     int64
 8   Mostly Low      44 non-null     int64
 9   Mostly High     44 non-null     int64
 10  Origin          44 non-null     object
 11  Item Size       44 non-null     object
 12  Unit of Sale    0 non-null      float64
 13  Repack          44 non-null     object
dtypes: float64(1), int64(4), object(9)
memory usage: 4.9+ KB

In [30]:
st_louis["Type"] = st_louis["Type"].fillna("Conventional")

In [31]:
st_louis = st_louis.drop(['Grade','Sub Variety', 'Origin District', 'Color', 'Environment', 'Quality', 'Condition', 'Appearance', 'Storage', 'Crop', 'Trans Mode'], axis = 1)

In [32]:
st_louis = st_louis.drop(['Price Comment', 'Comments', ], axis= 1)

In [33]:
st_louis = st_louis.drop(['Offerings'], axis=1)

In [34]:
st_louis[['Low Price','High Price']] = st_louis[['Low Price','High Price']].astype(int)

In [35]:
midwest_region = chicago.merge(detroit, how='outer').merge(st_louis, how='outer')

In [38]:
midwest_region.isnull().sum()

Commodity Name      0
City Name           0
Type                0
Package             0
Variety             0
Date                0
Low Price           0
High Price          0
Mostly Low        103
Mostly High       103
Origin              0
Item Size          54
Unit of Sale      395
Repack              0
Market Tone       292
dtype: int64

In [ ]:
midwest_region.groupby('Unit of Sale').agg(
    high_price_avg = ('High Price', 'mean'),
    low_price_avg = ("Low Price", 'mean')
)
# Unit of sale has too many missing values to count this, so I will calculate this by Package instead

Empty DataFrame
Columns: [high_price_avg, low_price_avg]
Index: []

In [41]:
midwest_region.groupby('Package').agg(
    high_price_avg = ('High Price', 'mean'),
    low_price_avg = ("Low Price", 'mean')
)

                      high_price_avg  low_price_avg
Package
1 1/9 bushel cartons       18.365079      17.936508
1/2 bushel cartons         16.756757      16.027027
22 lb cartons              14.000000      14.000000
24 inch bins              154.540230     151.965517
36 inch bins              174.060403     170.503356
bins                      174.166667     174.166667

In [42]:
northeast_region.groupby('Variety').agg(
    total_count = ('Commodity Name', 'count')
)

                          total_count
Variety
BIG MACK TYPE                      55
BLUE TYPE                           7
CINDERELLA                         39
FAIRYTALE                          37
HOWDEN TYPE                       224
HOWDEN WHITE TYPE                   2
KNUCKLE HEAD                        9
MINIATURE                          97
MIXED HEIRLOOM VARIETIES            4
PIE TYPE                          198